/*********************************************************************************************************
**
**                                    锟叫癸拷锟斤拷锟斤拷锟斤拷源锟斤拷织
**
**                                   嵌锟斤拷式实时锟斤拷锟斤拷系统
**
**                                SylixOS(TM)  LW : long wing
**
**                               Copyright All Rights Reserved
**
**--------------锟侥硷拷锟斤拷息--------------------------------------------------------------------------------
**
** 锟斤拷   锟斤拷   锟斤拷: bspLib.c
**
** 锟斤拷   锟斤拷   锟斤拷: Han.Hui (锟斤拷锟斤拷)
**
** 锟侥硷拷锟斤拷锟斤拷锟斤拷锟斤拷: 2007 锟斤拷 12 锟斤拷 09 锟斤拷
**
** 锟斤拷        锟斤拷: 锟斤拷锟斤拷锟斤拷锟斤拷要为 SylixOS 锟结供锟侥癸拷锟斤拷支锟斤拷.
*********************************************************************************************************/
#define  __SYLIXOS_KERNEL
#include "config.h"
#include "SylixOS.h"
#include "../driver/uart/uart.h"
#include "../driver/timer/timer.h"
#include "../driver/gic/arm_gic.h"
/*********************************************************************************************************
  BSP 锟斤拷息
*********************************************************************************************************/
/*
 * TODO: 锟睫革拷锟斤拷锟斤拷锟街凤拷锟斤拷为目锟斤拷锟斤拷 CPU 锟斤拷息
 */
static const CHAR   _G_pcCpuInfo[]     = "Quard-core ARM Cortex-A7 MPCore Processor";
/*
 * TODO: 锟睫革拷锟斤拷锟斤拷锟街凤拷锟斤拷为目锟斤拷锟斤拷 CACHE 锟斤拷息
 */
static const CHAR   _G_pcCacheInfo[]   = "32KBytes L1-Cache (D-16K/I-16K) 512 L2-Cache";
/*
 * TODO: 锟睫革拷锟斤拷锟斤拷锟街凤拷锟斤拷为目锟斤拷锟斤拷锟斤拷息
 */
static const CHAR   _G_pcPacketInfo[]  = "Quark Packet";
/*
 * TODO: 锟睫革拷锟斤拷锟斤拷锟街凤拷锟斤拷为 BSP 锟侥版本锟斤拷息
 */
static const CHAR   _G_pcVersionInfo[] = "BSP version 1.0.0 for "__SYLIXOS_RELSTR;

VOID  bspIntInit (VOID)
{
    armGicInit();
    armGicCPUInit(LW_FALSE, 255);
}
/*********************************************************************************************************
*********************************************************************************************************/
VOID  bspIntHandle (VOID)
{
    REGISTER UINT32  uiAck       = armGicIrqReadAck();

    REGISTER UINT32  uiSourceCpu = (uiAck >> 10) & 0x7;
    REGISTER UINT32  uiVector    = uiAck & GICC_IAR_IT_ID_MASK;
    (VOID)uiSourceCpu;
    archIntHandle((ULONG)uiVector, LW_FALSE);
    armGicIrqWriteDone(uiAck);
}
/*********************************************************************************************************
*********************************************************************************************************/
VOID  bspIntVectorEnable (ULONG  ulVector)
{
    armGicIntVecterEnable(ulVector, 127, 1 << 0);
}

VOID  bspIntVectorDisable (ULONG  ulVector)
{
    armGicIntVecterDisable(ulVector);
}

BOOL  bspIntVectorIsEnable (ULONG  ulVector)
{
    return  armGicIrqIsEnable(ulVector);
}

#if LW_CFG_INTER_PRIO > 0

ULONG   bspIntVectorSetPriority (ULONG  ulVector, UINT  uiPrio)
{
    return  (ERROR_NONE);
}

ULONG   bspIntVectorGetPriority (ULONG  ulVector, UINT  *puiPrio)
{
    *puiPrio = 0;
    return  (ERROR_NONE);
}

#endif                                                                  /*  LW_CFG_INTER_PRIO > 0       */

#if LW_CFG_INTER_TARGET > 0

ULONG   bspIntVectorSetTarget (ULONG  ulVector, size_t  stSize, const PLW_CLASS_CPUSET  pcpuset)
{
    return  (ERROR_NONE);
}
/*********************************************************************************************************
** 锟斤拷锟斤拷锟斤拷锟斤拷: bspIntVectorGetTarget
** 锟斤拷锟斤拷锟斤拷锟斤拷: 锟斤拷取指锟斤拷锟斤拷锟叫讹拷锟斤拷锟斤拷锟斤拷目锟斤拷 CPU
** 锟戒　锟斤拷  : ulVector      锟叫讹拷锟斤拷锟斤拷锟斤拷
**           stSize        CPU 锟斤拷锟诫集锟节达拷锟叫�
**           pcpuset       CPU 锟斤拷锟斤拷
** 锟戒　锟斤拷  : ERROR CODE
** 全锟街憋拷锟斤拷:
** 锟斤拷锟斤拷模锟斤拷:
*********************************************************************************************************/
ULONG   bspIntVectorGetTarget (ULONG  ulVector, size_t  stSize, PLW_CLASS_CPUSET  pcpuset)
{
    LW_CPU_ZERO(pcpuset);
    LW_CPU_SET(0, pcpuset);
    return  (ERROR_NONE);
}

#endif                                                                  /*  LW_CFG_INTER_TARGET > 0     */
/*********************************************************************************************************
  BSP 锟斤拷息
*********************************************************************************************************/
/*********************************************************************************************************
** 锟斤拷锟斤拷锟斤拷锟斤拷: bspInfoCpu
** 锟斤拷锟斤拷锟斤拷锟斤拷: BSP CPU 锟斤拷息
** 锟戒　锟斤拷  : NONE
** 锟戒　锟斤拷  : CPU 锟斤拷息
** 全锟街憋拷锟斤拷:
** 锟斤拷锟斤拷模锟斤拷:
*********************************************************************************************************/
CPCHAR  bspInfoCpu (VOID)
{
    return  (_G_pcCpuInfo);
}

CPCHAR  bspInfoCache (VOID)
{
    return  (_G_pcCacheInfo);
}
/*********************************************************************************************************
** 锟斤拷锟斤拷锟斤拷锟斤拷: bspInfoPacket
** 锟斤拷锟斤拷锟斤拷锟斤拷: BSP PACKET 锟斤拷息
** 锟戒　锟斤拷  : NONE
** 锟戒　锟斤拷  : PACKET 锟斤拷息
** 全锟街憋拷锟斤拷:
** 锟斤拷锟斤拷模锟斤拷:
*********************************************************************************************************/
CPCHAR  bspInfoPacket (VOID)
{
    return  (_G_pcPacketInfo);
}
/*********************************************************************************************************
** 锟斤拷锟斤拷锟斤拷锟斤拷: bspInfoVersion
** 锟斤拷锟斤拷锟斤拷锟斤拷: BSP VERSION 锟斤拷息
** 锟戒　锟斤拷  : NONE
** 锟戒　锟斤拷  : BSP VERSION 锟斤拷息
** 全锟街憋拷锟斤拷:
** 锟斤拷锟斤拷模锟斤拷:
*********************************************************************************************************/
CPCHAR  bspInfoVersion (VOID)
{
    return  (_G_pcVersionInfo);
}
/*********************************************************************************************************
** 锟斤拷锟斤拷锟斤拷锟斤拷: bspInfoHwcap
** 锟斤拷锟斤拷锟斤拷锟斤拷: BSP 硬锟斤拷锟斤拷锟斤拷
** 锟戒　锟斤拷  : NONE
** 锟戒　锟斤拷  : 硬锟斤拷锟斤拷锟斤拷 (锟斤拷锟街э拷锟接诧拷锟斤拷锟�, 锟斤拷锟皆硷拷锟斤拷 HWCAP_VFP , HWCAP_VFPv3 , HWCAP_VFPv3D16 , HWCAP_NEON)
** 全锟街憋拷锟斤拷:
** 锟斤拷锟斤拷模锟斤拷:
*********************************************************************************************************/
ULONG  bspInfoHwcap (VOID)
{
    /*
     * TODO: 锟斤拷锟斤拷硬锟斤拷锟斤拷锟斤拷 (锟斤拷锟街э拷锟接诧拷锟斤拷锟�, 锟斤拷锟皆硷拷锟斤拷 HWCAP_VFP , HWCAP_VFPv3 , HWCAP_VFPv3D16 , HWCAP_NEON)
     */
    return  (0ul);
}
/*********************************************************************************************************
** 锟斤拷锟斤拷锟斤拷锟斤拷: bspInfoRomBase
** 锟斤拷锟斤拷锟斤拷锟斤拷: BSP ROM 锟斤拷锟斤拷址
** 锟戒　锟斤拷  : NONE
** 锟戒　锟斤拷  : ROM 锟斤拷锟斤拷址
** 全锟街憋拷锟斤拷:
** 锟斤拷锟斤拷模锟斤拷:
*********************************************************************************************************/
addr_t bspInfoRomBase (VOID)
{
    return  (BSP_CFG_ROM_BASE);
}
/*********************************************************************************************************
** 锟斤拷锟斤拷锟斤拷锟斤拷: bspInfoRomSize
** 锟斤拷锟斤拷锟斤拷锟斤拷: BSP ROM 锟斤拷小
** 锟戒　锟斤拷  : NONE
** 锟戒　锟斤拷  : ROM 锟斤拷小
** 全锟街憋拷锟斤拷:
** 锟斤拷锟斤拷模锟斤拷:
*********************************************************************************************************/
size_t bspInfoRomSize (VOID)
{
    return  (BSP_CFG_ROM_SIZE);
}
/*********************************************************************************************************
** 锟斤拷锟斤拷锟斤拷锟斤拷: bspInfoRamBase
** 锟斤拷锟斤拷锟斤拷锟斤拷: BSP RAM 锟斤拷锟斤拷址
** 锟戒　锟斤拷  : NONE
** 锟戒　锟斤拷  : RAM 锟斤拷锟斤拷址
** 全锟街憋拷锟斤拷:
** 锟斤拷锟斤拷模锟斤拷:
*********************************************************************************************************/
addr_t bspInfoRamBase (VOID)
{
    return  (BSP_CFG_RAM_BASE);
}
/*********************************************************************************************************
** 锟斤拷锟斤拷锟斤拷锟斤拷: bspInfoRamSize
** 锟斤拷锟斤拷锟斤拷锟斤拷: BSP RAM 锟斤拷小
** 锟戒　锟斤拷  : NONE
** 锟戒　锟斤拷  : RAM 锟斤拷小
** 全锟街憋拷锟斤拷:
** 锟斤拷锟斤拷模锟斤拷:
*********************************************************************************************************/
size_t bspInfoRamSize (VOID)
{
    return  (BSP_CFG_RAM_SIZE);
}
/*********************************************************************************************************
  BSP HOOK
*********************************************************************************************************/
/*********************************************************************************************************
** 锟斤拷锟斤拷锟斤拷锟斤拷: bspTaskCreateHook
** 锟斤拷锟斤拷锟斤拷锟斤拷: 锟斤拷锟今创斤拷 hook
** 锟斤拷  锟斤拷  : ulId     锟斤拷锟斤拷 ID
** 锟斤拷  锟斤拷  : NONE
** 全锟街憋拷锟斤拷:
** 锟斤拷锟斤拷模锟斤拷:
*********************************************************************************************************/
VOID  bspTaskCreateHook (LW_OBJECT_ID  ulId)
{
    (VOID)ulId;

    /*
     * TODO: 锟斤拷锟斤拷锟斤拷拇锟斤拷锟斤拷锟斤拷锟�
     */
}
/*********************************************************************************************************
** 锟斤拷锟斤拷锟斤拷锟斤拷: bspTaskDeleteHook
** 锟斤拷锟斤拷锟斤拷锟斤拷: 锟斤拷锟斤拷删锟斤拷 hook
** 锟斤拷  锟斤拷  : ulId         锟斤拷锟斤拷 ID
**           pvReturnVal  锟斤拷锟斤拷值
**           ptcb         锟斤拷锟斤拷锟斤拷瓶锟�
** 锟斤拷  锟斤拷  : NONE
** 全锟街憋拷锟斤拷:
** 锟斤拷锟斤拷模锟斤拷:
*********************************************************************************************************/
VOID  bspTaskDeleteHook (LW_OBJECT_ID  ulId, PVOID  pvReturnVal, PLW_CLASS_TCB  ptcb)
{
    (VOID)ulId;
    (VOID)pvReturnVal;
    (VOID)ptcb;

    /*
     * TODO: 锟斤拷锟斤拷锟斤拷拇锟斤拷锟斤拷锟斤拷锟�
     */
}
/*********************************************************************************************************
** 锟斤拷锟斤拷锟斤拷锟斤拷: bspTaskSwapHook
** 锟斤拷锟斤拷锟斤拷锟斤拷: 锟斤拷锟斤拷锟叫伙拷 hook
** 锟斤拷  锟斤拷  : hOldThread       锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷
**           hNewThread       要锟斤拷锟叫碉拷锟斤拷锟斤拷
** 锟斤拷  锟斤拷  : NONE
** 全锟街憋拷锟斤拷:
** 锟斤拷锟斤拷模锟斤拷:
*********************************************************************************************************/
VOID  bspTaskSwapHook (LW_OBJECT_HANDLE   hOldThread, LW_OBJECT_HANDLE   hNewThread)
{
    (VOID)hOldThread;
    (VOID)hNewThread;

    /*
     * TODO: 锟斤拷锟斤拷锟斤拷拇锟斤拷锟斤拷锟斤拷锟�
     */
}
/*********************************************************************************************************
** 锟斤拷锟斤拷锟斤拷锟斤拷: bspTaskIdleHook
** 锟斤拷锟斤拷锟斤拷锟斤拷: idle 锟斤拷锟斤拷锟斤拷么撕锟斤拷锟�
** 锟斤拷  锟斤拷  : NONE
** 锟斤拷  锟斤拷  : NONE
** 全锟街憋拷锟斤拷:
** 锟斤拷锟斤拷模锟斤拷:
*********************************************************************************************************/
VOID  bspTaskIdleHook (VOID)
{
    /*
     * TODO: 锟斤拷锟斤拷锟斤拷拇锟斤拷锟斤拷锟斤拷锟�
     */
}
/*********************************************************************************************************
** 锟斤拷锟斤拷锟斤拷锟斤拷: bspTaskIdleHook
** 锟斤拷锟斤拷锟斤拷锟斤拷: 每锟斤拷锟斤拷锟斤拷系统时锟接斤拷锟侥ｏ拷系统锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟�
** 锟斤拷  锟斤拷  : i64Tick      系统锟斤拷前时锟斤拷
** 锟斤拷  锟斤拷  : NONE
** 全锟街憋拷锟斤拷:
** 锟斤拷锟斤拷模锟斤拷:
*********************************************************************************************************/
VOID  bspTickHook (INT64   i64Tick)
{
    (VOID)i64Tick;

    /*
     * TODO: 锟斤拷锟斤拷锟斤拷拇锟斤拷锟斤拷锟斤拷锟�
     */
}
/*********************************************************************************************************
** 锟斤拷锟斤拷锟斤拷锟斤拷: bspWdTimerHook
** 锟斤拷锟斤拷锟斤拷锟斤拷: 锟斤拷锟脚癸拷锟斤拷时锟斤拷锟斤拷时锟斤拷时锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷
** 锟斤拷  锟斤拷  : ulId     锟斤拷锟斤拷 ID
** 锟斤拷  锟斤拷  : NONE
** 全锟街憋拷锟斤拷:
** 锟斤拷锟斤拷模锟斤拷:
*********************************************************************************************************/
VOID  bspWdTimerHook (LW_OBJECT_ID  ulId)
{
    (VOID)ulId;

    /*
     * TODO: 锟斤拷锟斤拷锟斤拷拇锟斤拷锟斤拷锟斤拷锟�
     */
}
/*********************************************************************************************************
** 锟斤拷锟斤拷锟斤拷锟斤拷: bspTCBInitHook
** 锟斤拷锟斤拷锟斤拷锟斤拷: 锟斤拷始锟斤拷 TCB 时锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷
** 锟斤拷  锟斤拷  : ulId     锟斤拷锟斤拷 ID
**           ptcb     锟斤拷锟斤拷锟斤拷瓶锟�
** 锟斤拷  锟斤拷  : NONE
** 全锟街憋拷锟斤拷:
** 锟斤拷锟斤拷模锟斤拷:
*********************************************************************************************************/
VOID  bspTCBInitHook (LW_OBJECT_ID  ulId, PLW_CLASS_TCB   ptcb)
{
    (VOID)ulId;
    (VOID)ptcb;

    /*
     * TODO: 锟斤拷锟斤拷锟斤拷拇锟斤拷锟斤拷锟斤拷锟�
     */
}
/*********************************************************************************************************
** 锟斤拷锟斤拷锟斤拷锟斤拷: bspKernelInitHook
** 锟斤拷锟斤拷锟斤拷锟斤拷: 系统锟斤拷始锟斤拷锟斤拷锟绞憋拷锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟�
** 锟斤拷  锟斤拷  : NONE
** 锟斤拷  锟斤拷  : NONE
** 全锟街憋拷锟斤拷:
** 锟斤拷锟斤拷模锟斤拷:
*********************************************************************************************************/
VOID  bspKernelInitHook (VOID)
{
    /*
     * TODO: 锟斤拷锟斤拷锟斤拷拇锟斤拷锟斤拷锟斤拷锟�
     */
}
/*********************************************************************************************************
** 锟斤拷锟斤拷锟斤拷锟斤拷: bspReboot
** 锟斤拷锟斤拷锟斤拷锟斤拷: 系统锟斤拷锟斤拷锟斤拷锟斤拷
** 锟戒　锟斤拷  : iRebootType       锟斤拷锟斤拷锟斤拷锟斤拷
**           ulStartAddress    锟斤拷锟斤拷锟斤拷始锟斤拷址
** 锟戒　锟斤拷  : NONE
** 全锟街憋拷锟斤拷:
** 锟斤拷锟斤拷模锟斤拷:
*********************************************************************************************************/
VOID  bspReboot (INT  iRebootType, addr_t  ulStartAddress)
{
    (VOID)ulStartAddress;

    /*
     * TODO: 锟斤拷锟斤拷锟斤拷拇锟斤拷锟斤拷锟斤拷锟�, 锟斤拷锟斤拷使锟斤拷硬锟斤拷锟斤拷锟脚癸拷锟斤拷硬锟斤拷锟斤拷位锟斤拷路锟斤拷锟斤拷位, 锟斤拷锟矫伙拷锟�, 锟斤拷锟斤拷锟斤拷锟斤拷拇锟斤拷锟�
     */

#ifdef __BOOT_INRAM
    ((VOID (*)(INT))bspInfoRamBase())(iRebootType);
#else
    ((VOID (*)(INT))bspInfoRomBase())(iRebootType);
#endif                                                                  /*  __BOOT_INRAM                */
}
/*********************************************************************************************************
** 锟斤拷锟斤拷锟斤拷锟斤拷: bspDebugMsg
** 锟斤拷锟斤拷锟斤拷锟斤拷: 锟斤拷印系统锟斤拷锟斤拷锟斤拷息
** 锟戒　锟斤拷  : pcMsg     锟斤拷息
** 锟戒　锟斤拷  : NONE
** 全锟街憋拷锟斤拷:
** 锟斤拷锟斤拷模锟斤拷:
*********************************************************************************************************/

VOID  bspDebugMsg (CPCHAR  pcMsg)
{

    uartPutMsg(pcMsg);
}
/*********************************************************************************************************
  CACHE 锟斤拷亟涌锟�
*********************************************************************************************************/
/*********************************************************************************************************
** 锟斤拷锟斤拷锟斤拷锟斤拷: bspL2CBase
** 锟斤拷锟斤拷锟斤拷锟斤拷: 锟斤拷锟� L2 锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷址
** 锟斤拷  锟斤拷  : pulBase      锟斤拷锟截的伙拷锟斤拷址
** 锟斤拷  锟斤拷  : -1 锟斤拷示锟斤拷锟斤拷锟斤拷 L2
** 全锟街憋拷锟斤拷:
** 锟斤拷锟斤拷模锟斤拷:
*********************************************************************************************************/
INT  bspL2CBase (addr_t  *pulBase)
{
    /*
     * TODO: 通锟斤拷锟斤拷锟侥达拷锟斤拷锟斤拷锟街诧拷, 锟斤拷 L2 锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷址锟斤拷锟斤拷 *pulBase 锟斤拷锟斤拷,
     * 锟斤拷锟斤拷锟斤拷锟斤拷锟� L2, 锟斤拷锟斤拷 PX_ERROR 锟斤拷锟斤拷, 锟斤拷锟斤拷锟斤拷锟�, 锟斤拷锟斤拷 ERROR_NONE
     */
    return  (PX_ERROR);
}
/*********************************************************************************************************
** 锟斤拷锟斤拷锟斤拷锟斤拷: bspL2CAux
** 锟斤拷锟斤拷锟斤拷锟斤拷: 锟斤拷锟� L2 锟斤拷锟斤拷锟斤拷 Aux 锟斤拷锟斤拷锟斤拷锟斤拷
** 锟斤拷  锟斤拷  : puiAuxVal      Aux 锟侥达拷锟斤拷值
**           puiAuxMask     Aux 锟斤拷锟斤拷锟斤拷锟斤拷
** 锟斤拷  锟斤拷  : -1 锟斤拷示锟斤拷锟斤拷锟斤拷 L2
** 全锟街憋拷锟斤拷:
** 锟斤拷锟斤拷模锟斤拷:
*********************************************************************************************************/
INT  bspL2CAux (UINT32  *puiAuxVal, UINT32  *puiAuxMask)
{
    /*
     * TODO: 通锟斤拷锟斤拷取硬锟斤拷 Aux 锟侥达拷锟斤拷, 锟斤拷锟斤拷锟斤拷 *puiAuxVal 锟斤拷锟斤拷, 锟斤拷锟斤拷 Aux 锟斤拷锟斤拷锟斤拷锟诫赋锟斤拷 *puiAuxMask 锟斤拷锟斤拷,
     * 锟斤拷锟斤拷锟斤拷锟斤拷锟� L2, 锟斤拷锟斤拷 PX_ERROR 锟斤拷锟斤拷, 锟斤拷锟斤拷锟斤拷锟�, 锟斤拷锟斤拷 ERROR_NONE
     */
    *puiAuxVal  =  0u;
    *puiAuxMask = ~0u;
    
    return  (ERROR_NONE);
}
/*********************************************************************************************************
  MMU 锟斤拷亟涌锟�
*********************************************************************************************************/
/*********************************************************************************************************
** 锟斤拷锟斤拷锟斤拷锟斤拷: bspMmuPgdMaxNum
** 锟斤拷锟斤拷锟斤拷锟斤拷: 锟斤拷锟� PGD 锟截碉拷锟斤拷锟斤拷
** 锟斤拷  锟斤拷  : NONE
** 锟斤拷  锟斤拷  : PGD 锟截碉拷锟斤拷锟斤拷 (1 锟斤拷锟截匡拷映锟斤拷 4GB 锟秸硷拷, 锟狡硷拷锟斤拷锟斤拷 1)
** 全锟街憋拷锟斤拷:
** 锟斤拷锟斤拷模锟斤拷:
*********************************************************************************************************/
ULONG  bspMmuPgdMaxNum (VOID)
{
    /*
     * TODO: 锟斤拷锟斤拷 PGD 锟截碉拷锟斤拷锟斤拷, 锟狡硷拷锟斤拷锟斤拷 1
     */
    return  (1);
}
/*********************************************************************************************************
** 锟斤拷锟斤拷锟斤拷锟斤拷: bspMmuPgdMaxNum
** 锟斤拷锟斤拷锟斤拷锟斤拷: 锟斤拷锟� PTE 锟截碉拷锟斤拷锟斤拷
** 锟斤拷  锟斤拷  : NONE
** 锟斤拷  锟斤拷  : PTE 锟截碉拷锟斤拷锟斤拷 (映锟斤拷 4GB 锟秸硷拷, 锟斤拷要 4096 锟斤拷 PTE 锟斤拷)
** 全锟街憋拷锟斤拷:
** 锟斤拷锟斤拷模锟斤拷:
*********************************************************************************************************/
ULONG  bspMmuPteMaxNum (VOID)
{
    /*
     * TODO: 锟斤拷锟斤拷 PTE 锟截碉拷锟斤拷锟斤拷 (映锟斤拷 4GB 锟秸硷拷, 锟斤拷要 4096 锟斤拷 PTE 锟斤拷)
     */
    return  (2048);
}
/*********************************************************************************************************
  锟斤拷锟斤拷系统锟斤拷私涌锟�
*********************************************************************************************************/
/*********************************************************************************************************
** 锟斤拷锟斤拷锟斤拷锟斤拷: bspMpInt
** 锟斤拷锟斤拷锟斤拷锟斤拷: 锟斤拷锟斤拷一锟斤拷锟剿硷拷锟叫讹拷
** 锟斤拷  锟斤拷  : ulCPUId      目锟斤拷 CPU
** 锟斤拷  锟斤拷  : NONE
** 全锟街憋拷锟斤拷:
** 锟斤拷锟斤拷模锟斤拷:
*********************************************************************************************************/
VOID   bspMpInt (ULONG  ulCPUId)
{
    (VOID)ulCPUId;

    /*
     * TODO: 锟斤拷锟斤拷锟斤拷拇锟斤拷锟斤拷锟斤拷锟�
     */
}
/*********************************************************************************************************
** 锟斤拷锟斤拷锟斤拷锟斤拷: bspCpuUp
** 锟斤拷锟斤拷锟斤拷锟斤拷: 锟斤拷锟斤拷一锟斤拷 CPU
** 锟斤拷  锟斤拷  : ulCPUId      目锟斤拷 CPU
** 锟斤拷  锟斤拷  : NONE
** 全锟街憋拷锟斤拷:
** 锟斤拷锟斤拷模锟斤拷:
*********************************************************************************************************/
VOID   bspCpuUp (ULONG  ulCPUId)
{
    /*
     * TODO: 锟斤拷锟斤拷锟斤拷拇锟斤拷锟斤拷锟斤拷锟�, 锟斤拷锟矫伙拷锟�, 锟诫保锟斤拷锟斤拷锟斤拷牡锟斤拷锟斤拷锟较�
     */
    bspDebugMsg("bspCpuUp() error: this cpu CAN NOT support this operate!\r\n");
}
/*********************************************************************************************************
** 锟斤拷锟斤拷锟斤拷锟斤拷: bspCpuDown
** 锟斤拷锟斤拷锟斤拷锟斤拷: 停止一锟斤拷 CPU
** 锟斤拷  锟斤拷  : ulCPUId      目锟斤拷 CPU
** 锟斤拷  锟斤拷  : NONE
** 全锟街憋拷锟斤拷:
** 锟斤拷锟斤拷模锟斤拷:
*********************************************************************************************************/
VOID   bspCpuDown (ULONG  ulCPUId)
{
    /*
     * TODO: 锟斤拷锟斤拷锟斤拷拇锟斤拷锟斤拷锟斤拷锟�, 锟斤拷锟矫伙拷锟�, 锟诫保锟斤拷锟斤拷锟斤拷牡锟斤拷锟斤拷锟较�
     */
    bspDebugMsg("bspCpuDown() error: this cpu CAN NOT support this operate!\r\n");
}
/*********************************************************************************************************
  锟斤拷锟斤拷系统 CPU 锟劫度匡拷锟狡接匡拷
*********************************************************************************************************/
/*********************************************************************************************************
** 锟斤拷锟斤拷锟斤拷锟斤拷: bspSuspend
** 锟斤拷锟斤拷锟斤拷锟斤拷: 系统锟斤拷锟斤拷锟斤拷锟斤拷状态
** 锟斤拷  锟斤拷  : NONE
** 锟斤拷  锟斤拷  : NONE
** 全锟街憋拷锟斤拷:
** 锟斤拷锟斤拷模锟斤拷:
*********************************************************************************************************/
VOID    bspSuspend (VOID)
{
    /*
     * TODO: 锟斤拷锟斤拷锟斤拷拇锟斤拷锟斤拷锟斤拷锟�, 锟斤拷锟矫伙拷锟�, 锟诫保锟斤拷锟斤拷锟斤拷牡锟斤拷锟斤拷锟较�
     */
    bspDebugMsg("bspSuspend() error: this BSP CAN NOT support this operate!\r\n");
}
/*********************************************************************************************************
** 锟斤拷锟斤拷锟斤拷锟斤拷: bspCpuPowerSet
** 锟斤拷锟斤拷锟斤拷锟斤拷: CPU 锟斤拷锟斤拷锟斤拷锟斤拷锟劫讹拷
** 锟斤拷  锟斤拷  : uiPowerLevel     锟斤拷锟斤拷锟劫度硷拷锟斤拷
** 锟斤拷  锟斤拷  : NONE
** 全锟街憋拷锟斤拷:
** 锟斤拷锟斤拷模锟斤拷:
*********************************************************************************************************/
VOID    bspCpuPowerSet (UINT  uiPowerLevel)
{
    /*
     * TODO: 锟斤拷锟斤拷锟斤拷拇锟斤拷锟斤拷锟斤拷锟�
     */
}
/*********************************************************************************************************
** 锟斤拷锟斤拷锟斤拷锟斤拷: bspCpuPowerGet
** 锟斤拷锟斤拷锟斤拷锟斤拷: CPU 锟斤拷取锟斤拷锟斤拷锟劫讹拷
** 锟斤拷  锟斤拷  : puiPowerLevel    锟斤拷锟斤拷锟劫度硷拷锟斤拷
** 锟斤拷  锟斤拷  : NONE
** 全锟街憋拷锟斤拷:
** 锟斤拷锟斤拷模锟斤拷:
*********************************************************************************************************/
VOID    bspCpuPowerGet (UINT  *puiPowerLevel)
{
    /*
     * TODO: 锟斤拷锟斤拷锟斤拷拇锟斤拷锟斤拷锟斤拷锟�, 锟斤拷锟矫伙拷锟�, 锟诫保锟斤拷锟斤拷锟斤拷拇锟斤拷锟�
     */
    if (puiPowerLevel) {
        *puiPowerLevel = LW_CPU_POWERLEVEL_TOP;
    }
}
/*********************************************************************************************************
  锟斤拷锟斤拷系统时锟斤拷锟斤拷睾锟斤拷锟�
*********************************************************************************************************/
/*********************************************************************************************************
  TICK 锟斤拷锟斤拷锟斤拷锟斤拷锟斤拷锟�
*********************************************************************************************************/
#define TICK_IN_THREAD  0
#if TICK_IN_THREAD > 0
static LW_HANDLE    htKernelTicks;                                      /*  锟斤拷锟斤拷系统时锟接凤拷锟斤拷锟竭程撅拷锟�    */
#endif                                                                  /*  TICK_IN_THREAD > 0          */
/*********************************************************************************************************
** 锟斤拷锟斤拷锟斤拷锟斤拷: __tickThread
** 锟斤拷锟斤拷锟斤拷锟斤拷: 锟斤拷始锟斤拷 tick 锟斤拷锟斤拷锟竭筹拷
** 锟斤拷  锟斤拷  : NONE
** 锟斤拷  锟斤拷  : NONE
** 全锟街憋拷锟斤拷:
** 锟斤拷锟斤拷模锟斤拷:
*********************************************************************************************************/
#if TICK_IN_THREAD > 0

static VOID  __tickThread (VOID)
{
    for (;;) {
        API_ThreadSuspend(htKernelTicks);
        API_KernelTicks();                                              /*  锟节猴拷 TICKS 通知             */
        API_TimerHTicks();                                              /*  锟斤拷锟斤拷 TIMER TICKS 通知       */
    }
}

#endif                                                                  /*  TICK_IN_THREAD > 0          */
/*********************************************************************************************************
** 锟斤拷锟斤拷锟斤拷锟斤拷: __tickTimerIsr
** 锟斤拷锟斤拷锟斤拷锟斤拷: tick 锟斤拷时锟斤拷锟叫断凤拷锟斤拷锟斤拷锟�
** 锟斤拷  锟斤拷  : NONE
** 锟斤拷  锟斤拷  : 锟叫断凤拷锟今返伙拷
** 全锟街憋拷锟斤拷:
** 锟斤拷锟斤拷模锟斤拷:
*********************************************************************************************************/
static irqreturn_t  __tickTimerIsr (VOID)
{
    /*
     * TODO: 通锟斤拷锟斤拷锟斤拷硬锟斤拷锟侥达拷锟斤拷, 锟斤拷锟� tick 锟斤拷时锟斤拷锟叫讹拷
     */

    timerIntClear(0);
    API_KernelTicksContext();                                           /*  锟斤拷锟芥被时锟斤拷锟叫断碉拷锟竭程匡拷锟狡匡拷  */

#if TICK_IN_THREAD > 0
    API_ThreadResume(htKernelTicks);
#else
    API_KernelTicks();                                                  /*  锟节猴拷 TICKS 通知             */
    API_TimerHTicks();                                                  /*  锟斤拷锟斤拷 TIMER TICKS 通知       */
#endif                                                                  /*  TICK_IN_THREAD > 0          */
    
    return  (LW_IRQ_HANDLED);
}
/*********************************************************************************************************
** 锟斤拷锟斤拷锟斤拷锟斤拷: bspTickInit
** 锟斤拷锟斤拷锟斤拷锟斤拷: 锟斤拷始锟斤拷 tick 时锟斤拷
** 锟斤拷  锟斤拷  : NONE
** 锟斤拷  锟斤拷  : NONE
** 全锟街憋拷锟斤拷:
** 锟斤拷锟斤拷模锟斤拷:
*********************************************************************************************************/
VOID  bspTickInit (VOID)
{
#if TICK_IN_THREAD > 0
    LW_CLASS_THREADATTR  threadattr;
#endif                                                                  /*  TICK_IN_THREAD > 0          */
    ULONG                ulVector = TIMER_VECTOR(0);

#if TICK_IN_THREAD > 0
    API_ThreadAttrBuild(&threadattr, (8 * LW_CFG_KB_SIZE),
                        LW_PRIO_T_TICK,
                        LW_OPTION_THREAD_STK_CHK |
                        LW_OPTION_THREAD_UNSELECT |
                        LW_OPTION_OBJECT_GLOBAL |
                        LW_OPTION_THREAD_SAFE, LW_NULL);

    htKernelTicks = API_ThreadCreate("t_tick",
                                     (PTHREAD_START_ROUTINE)__tickThread,
                                     &threadattr,
                                     NULL);
#endif                                                                  /*  TICK_IN_THREAD > 0          */

    /*
     * TODO: 锟斤拷始锟斤拷硬锟斤拷锟斤拷时锟斤拷, 频锟斤拷为 LW_TICK_HZ, 锟斤拷锟斤拷为锟皆讹拷锟斤拷装, 锟斤拷锟斤拷硬锟斤拷锟斤拷时锟斤拷
     *
     * 锟斤拷锟斤拷硬锟斤拷锟斤拷时锟斤拷锟斤拷锟斤拷锟斤拷锟叫断号革拷锟斤拷 ulVector 锟斤拷锟斤拷
     */
    API_InterVectorConnect(ulVector,
                           (PINT_SVR_ROUTINE)__tickTimerIsr,
                           LW_NULL,
                           "tick_timer");

    API_InterVectorEnable(ulVector);

    timerStart(0, LW_TICK_HZ);
}
/*********************************************************************************************************
** 锟斤拷锟斤拷锟斤拷锟斤拷: bspTickHighResolution
** 锟斤拷锟斤拷锟斤拷锟斤拷: 锟斤拷锟斤拷锟斤拷锟斤拷锟揭伙拷锟� tick 锟斤拷锟斤拷前锟侥撅拷确时锟斤拷.
** 锟戒　锟斤拷  : ptv       锟斤拷要锟斤拷锟斤拷锟斤拷时锟斤拷
** 锟戒　锟斤拷  : NONE
** 全锟街憋拷锟斤拷:
** 锟斤拷锟斤拷模锟斤拷:
*********************************************************************************************************/
VOID  bspTickHighResolution (struct timespec *ptv)
{
    /*
     * TODO: 锟睫革拷为锟斤拷拇锟斤拷锟斤拷锟斤拷锟�
     */
}
/*********************************************************************************************************
** 锟斤拷锟斤拷锟斤拷锟斤拷: bspDelayUs
** 锟斤拷锟斤拷锟斤拷锟斤拷: 锟接筹拷微锟斤拷
** 锟斤拷  锟斤拷  : ulUs     微锟斤拷锟斤拷
** 锟斤拷  锟斤拷  : NONE
** 全锟街憋拷锟斤拷:
** 锟斤拷锟斤拷模锟斤拷:
*********************************************************************************************************/
VOID bspDelayUs (ULONG ulUs)
{
    /*
     * TODO: 锟斤拷锟斤拷锟斤拷拇锟斤拷锟斤拷锟斤拷锟斤拷锟�, 锟睫革拷为锟斤拷拇锟斤拷锟斤拷锟斤拷锟�
     */
    volatile UINT  i;

    while (ulUs) {
        ulUs--;
        for (i = 0; i < 80; i++) {
        }
    }
}
/*********************************************************************************************************
** 锟斤拷锟斤拷锟斤拷锟斤拷: bspDelayNs
** 锟斤拷锟斤拷锟斤拷锟斤拷: 锟接筹拷锟斤拷锟斤拷
** 锟斤拷  锟斤拷  : ulNs     锟斤拷锟斤拷锟斤拷
** 锟斤拷  锟斤拷  : NONE
** 全锟街憋拷锟斤拷:
** 锟斤拷锟斤拷模锟斤拷:
*********************************************************************************************************/
VOID  bspDelayNs (ULONG ulNs)
{
    /*
     * TODO: 锟斤拷锟斤拷锟斤拷拇锟斤拷锟斤拷锟斤拷锟斤拷锟�, 锟睫革拷为锟斤拷拇锟斤拷锟斤拷锟斤拷锟�
     */
    volatile UINT  i;

    while (ulNs) {
        ulNs = (ulNs < 100) ? (0) : (ulNs - 100);
        for (i = 0; i < 40; i++) {
        }
    }
}
/*********************************************************************************************************
  semihosting
*********************************************************************************************************/
#define import(__use_no_semihosting_swi)

void  _ttywrch (int  ch)
{
    bspDebugMsg("__use_no_semihosting_swi _ttywrch()!\n");
    while (1);
}

void  _sys_exit (int  return_code)
{
    bspDebugMsg("__use_no_semihosting_swi _sys_exit()!\n");
    while (1);
}
/*********************************************************************************************************
  GCC 锟斤拷锟斤拷
*********************************************************************************************************/
#ifdef __GNUC__
int  __aeabi_read_tp (void)
{
    return  (0);
}
#endif                                                                  /*  __GNUC__                    */
/*********************************************************************************************************
  END
*********************************************************************************************************/
